tests/com/l7tech/policy/resources/basicsecurityprofile/R3071_success_01.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope
    xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
    xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soap:Header>
        <wsse:Security>
            <wsse:SecurityTokenReference>
                <wsse:KeyIdentifier EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary"/>
            </wsse:SecurityTokenReference>
        </wsse:Security>
    </soap:Header>
    <soap:Body>
        <tns:listProducts xmlns:tns="http://warehouse.acme.com/ws"/>
    </soap:Body>
</soap:Envelope>
